{
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": { "name": "float32" },
      "registered_name": null,
      "shared_object_id": 125409677259696
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, 20, 13],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 64,
          "kernel_size": [3],
          "strides": [1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 20, 13] }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null,
            "shared_object_id": 125409677259696
          },
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 18, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling1D",
        "config": {
          "name": "max_pooling1d",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null,
            "shared_object_id": 125409677259696
          },
          "pool_size": [2],
          "padding": "valid",
          "strides": [2],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "LSTM",
        "config": {
          "name": "lstm",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null,
            "shared_object_id": 125409677259696
          },
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "zero_output_for_mask": false,
          "units": 128,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null,
            "shared_object_id": 125409677260752
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": { "seed": null, "gain": 1.0 },
            "registered_name": null,
            "shared_object_id": 125409677257824
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null,
            "shared_object_id": 125409677257152
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "seed": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 9, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null,
            "shared_object_id": 125409677259696
          },
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null,
            "shared_object_id": 125409677259696
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 128] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null,
            "shared_object_id": 125409677259696
          },
          "units": 2,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 64] }
      }
    ],
    "build_input_shape": [null, 20, 13]
  },
  "registered_name": null,
  "build_config": { "input_shape": [null, 20, 13] },
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "Adam",
      "config": {
        "name": "adam",
        "learning_rate": 0.0010000000474974513,
        "weight_decay": null,
        "clipnorm": null,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "beta_1": 0.9,
        "beta_2": 0.999,
        "epsilon": 1e-7,
        "amsgrad": false
      },
      "registered_name": null
    },
    "loss": "categorical_crossentropy",
    "loss_weights": null,
    "metrics": ["accuracy"],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": false
  }
}
